Repository: UberPay/ether-and-erc20-tokens-woocommerce-payment-gateway
Catalog: languages/ether-and-erc20-tokens-woocommerce-payment-gateway-*.po
Languages: ru_ru

source: Settings
ru_ru: Настройки

source: Unknown network name in configuration settings
ru_ru: Неизвестное название сети настройках

source: call contract %s method %s for market %s for order %s
ru_ru: вызов контракта %s. Метод %s. Адрес магазина %s. Номер заказа %s

source: call contract %s method decimals
ru_ru: вызов контракта %s. Метод decimals

source: Pay with Ether or ERC20 token
ru_ru: Заплатить эфиром (ETH) или ERC20 токеном

source: Payment of %s ETH or an equvalent in ERC20 supported tokens will be due.
ru_ru: Оплата %s ETH или эквивалента в одном из принимаемых к оплате ERC20 токенов.

source: Problem performing currency conversion: %s
ru_ru: Не удалось выполнить конвертацию валюты %s

source: Unable to provide an order value in ETH at this time. Please contact support.
ru_ru: Не удалось получить стоимость заказа в ETH. Пожалуйста, обратитесь в службу поддержки.

source: ETH price quote has been updated, please check and confirm before proceeding.
ru_ru: Курс ETH был обновлён. Пожалуйста, проверьте и подтвердите прежде чем продолжить.

source: Enable / disable
ru_ru: Включить / Выключить

source: Enable payment with Ether or ERC20 tokens
ru_ru: Включить оплату ETH и токенами ERC20

source: Basic settings
ru_ru: Базовые настройки

source: Enable debug mode
ru_ru: Включить режим отладки

source: Enable only if you are diagnosing problems.
ru_ru: Включайте только если наблюдаются проблемы в функциональности плагина.

source: Log interactions inside <code>%s</code>
ru_ru: Файл логов <code>%s</code>

source: Title
ru_ru: Название

source: This controls the name of the payment option that the user sees during checkout.
ru_ru: Отображается в названии способа платежа.

source: Pay with ETH or ERC20 token
ru_ru: Оплатить с помощью ETH или токена ERC20

source: Short description
ru_ru: Краткое описание

source: This controls the description of the payment option that the user sees during checkout.
ru_ru: Краткое описание способа платежа.

source: API credentials
ru_ru: Ключи доступа к сторонним API

source: Infura API Key
ru_ru: Ключ доступа к API infura.io

source: <p>The API key for the <a target="_blank" href="%s">%s</a>. You need to register on this site to obtain it.</p>
ru_ru: <p>Ключ доступа к API <a target="_blank" href="%s">%s</a>. Зарегистрируйтесь на сайте infura.io чтобы получить свой ключ.</p>

source: Blockchain
ru_ru: Блокчейн

source: <p>The blockchain used: mainnet or ropsten. Use mainnet in production, and ropsten in test mode.</p>
ru_ru: <p>Используемая сеть: mainnet или ropsten. Используйте mainnet для нормальной работы, и ropsten для тестирования.</p>

source: Payment details
ru_ru: Детали оплаты

source: Your ethereum address
ru_ru: Адрес вашего аккаунта Ethereum

source: The ethereum address payment should be sent to. Make sure to use one address per one online store. Do not use one address for two or more stores! Also, make sure to use a ERC20 tokens compatible wallet if you are planning to accept it!
ru_ru: Ethereum адрес, на который будет производиться оплата. Убедитесь, что ваш аккаунт поддерживает приём ERC20 токенов, если вы планируете принимать их. Используйте один адрес для одного магазина. Нельзя использовать один адрес для двух и более магазинов!

source: Supported ERC20 tokens list
ru_ru: Список принимаемых к оплате токенов ERC20

source: Provide a list of tokens you want to support. It should be in a format like this: Token_symbol1:token_eth_address1:token_price_eth1,Token_symbol2:token_eth_address2:token_price_eth2. For example: TSX:0xe762Da33bf2b2412477c65b01f46D923A7Ef5794:0.001,EOS:0x86Fa049857E0209aa7D9e616F7eb3b3B78ECfdb0:0.01054550
ru_ru: Введите список ERC20 токенов, которые вы будете принимать к оплате. Формат списка: Token_symbol1:token_eth_address1:token_price_eth1,Token_symbol2:token_eth_address2:token_price_eth2. Например: TSX:0xe762Da33bf2b2412477c65b01f46D923A7Ef5794:0.001,EOS:0x86Fa049857E0209aa7D9e616F7eb3b3B78ECfdb0:0.01054550

source: Disable Ether
ru_ru: Не принимать Ether

source: Disallow customer to pay with Ether
ru_ru: Запретить покупателю платить с использованием Ether

source: This option is useful to accept only some token. It is an advanced option. Use with care.
ru_ru: Эта настройка позволяет настроить продажу только за какой-то токен. Это продвинутая функциональность. Используйте только если полностью уверены.

source: Gas limit
ru_ru: Ограничение газа

source: The gas limit for transaction.
ru_ru: Максимальное количество газа для транзакции.

source: Gas price, Gwei
ru_ru: Стоимость газа, Gwei

source: The gas price for transaction.
ru_ru: Стоимость газа для транзакции.

source: Mark Ether price up by %
ru_ru: При оплате с помощью Ether увеличить стоимость товара на указанный %

source: To help cover currency fluctuations the plugin can automatically mark up converted rates for you. These are applied as percentage markup, so a 1ETH value with a 1.00% markup will be presented to the customer as 1.01ETH.
ru_ru: Чтобы сгладить колебания цен криптовалют этот плагин может автоматически увеличивать цену товара на указанный здесь процент. Таким образом, для значения в 1% товар стоимостью 1ETH будет продан пользователю за 1.01ETH.

source: Mark ERC20 token price up by %
ru_ru: При оплате с помощью ERC20 токена увеличить стоимость товара на указанный %

source: To help cover currency fluctuations the plugin can automatically mark up converted rates for you. These are applied as percentage markup, so a 1 ERC20 Token value with a 1.00% markup will be presented to the customer as 1.01 Token.
ru_ru: Чтобы сгладить колебания цен криптовалют этот плагин может автоматически увеличивать цену товара на указанный здесь процент. Таким образом, для значения в 1% товар стоимостью 1 токен будет продан пользователю за 1.01 токена.

source: Need help to configure this plugin?
ru_ru: Нужна помощь в настройке этого плагина?

source: Feel free to %1$shire me!%2$s
ru_ru: Наймите %1$sменя!%2$s

source: Need help to develop a ERC20 token for your ICO?
ru_ru: Нужна помощь в создании ERC20 токена для вашего ICO?

source: Want to sell your ERC20/ERC223 ICO token from your ICO site?
ru_ru: Хотите продавать ваши ERC20/ERC223 ICO токены с вашего ICO сайта?

source: Install the %1$sThe EthereumICO Wordpress plugin%2$s!
ru_ru: Установите %1$sEthereumICO WordPress%2$s плагин!

source: Want to sell ERC20 token for fiat and/or Bitcoin?
ru_ru: Хотите продавать ваши ERC20 токены за рубли или Bitcoin?

source: Install the %1$sCryptocurrency Product for WooCommerce plugin%2$s!
ru_ru: Установите плагин %1$sCryptocurrency Product for WooCommerce%2$s!

source: Want to create Ethereum wallets on your Wordpress site?
ru_ru: Хотите создавать Ethereum-кошельки для ваших пользователей?

source: Install the %1$sWordPress Ethereum Wallet plugin%2$s!
ru_ru: Установите %1$sWordPress Ethereum Wallet%2$s плагин!

source: Your customers will be given instructions about where, and how much to pay. Your orders will be marked as on-hold when they are placed. And as complete when payment is recieved. You can update your orders on the <a href="%s">WooCommerce Orders</a> page.
ru_ru: Ваши покупатели получат инструкции где и как оплатить заказ. Заказ будет помечен как "На удержании" при создании, и как "Выполненный" после подтверждения платежа. Вы всегда сможете обновить или удалить заказы на странице <a href="%s">Заказов WooCommerce</a>.

source: Order submitted, and payment with %s requested.
ru_ru: Создан заказ и запрошена оплата в %s.

source: Order value calculated as %f %s
ru_ru: Сумма заказа %f %s

source: Awaiting payment.
ru_ru: Ожидание оплаты.

source: Order do not need payment, tx check stopped: %s
ru_ru: Заказ %s уже оплачен, прекращаем проверки

source: Order expired. Order updated to failed: %s
ru_ru: Оплата заказа не не была выполнена в срок. Статус заказа %s обновлён до Неудавшийся

source: Order was expired.
ru_ru: Заказ просрочен.

source: No payment found for order: %s
ru_ru: Не обнаружено оплаты для заказа %s

source: PaymentInfo recieved for order_id=%s. %s: %s. eth_value=%s, eth_value_wei=%s
ru_ru: Информация об оплате получена для заказа №%s. %s: %s. eth_value=%s, eth_value_wei=%s

source: Successful payment notification received. Order updated to pending.
ru_ru: Получено подтверждение оплаты. Статус заказа обновлён до "В ожидании".

source: Non-successful payment notification received. Order updated to failed: %s
ru_ru: Оплата заказа не удалась. Статус заказа %s обновлён до Неудавшийся

source: Non-successful payment notification received. Order updated to failed.
ru_ru: Оплата заказа не удалась. Статус заказа обновлён до Неудавшийся.

source: Non-successful payment notification.
ru_ru: Оплата заказа не удалась.

source: The ERC20 token payment consists of two steps.
ru_ru: Оплата токеном ERC20 проводится в два этапа.

source: Deposit funds to the payment gateway smart contract in the Ethereum blockchain, and
ru_ru: Внести депозит на баланс смарт контракта платёжного шлюза, и

source: Use this deposit to pay for your order.
ru_ru: Оплатить заказ списав средства с внесённого на первом шаге депозита.

source: You have to send two transactions to the Ethereum blockchain: first for deposit and second for the real payment.
ru_ru: Вам нужно подписать две транзакции: одна для внесения депозита и вторая для непосредственной оплаты.

source: Step 2: Release deposit for payment.
ru_ru: Шаг 2: Списать средства с депозита для оплаты заказа.

source: Send a command to the payment gateway smart contract to do the actual payment for you. The payment gateway smart contract can not spend your tokens without your command. And nobody except you can send this command to the gateway contract. But note, that if you cancel the order on this step and then decide to pay for this or any other order with the same token again, you'll be asked to approve 0 (zero) amount of tokens first, and only after that you'll be able to approve the desired token amount. It is true even for purchases on other stores that use the same payment gateway. It is due to the ERC20 token internal limitations.
ru_ru: Отсылка смарт контракту платёжного шлюза команды на проведение платежа по текущему заказу. Контракт платёжного шлюза может потратить ваши токены только по вашей команде. Никто кроме вас не сможет дать шлюзу такую команду. Однако если вы решите прервать этот заказ, а потом снова попытаетесь оплатить его или другой заказ теми же токенами, платёжный шлюз сначала попросит вас выполнить команду approve для 0 (нулевого) количества токенов, и лишь затем вы сможете сделать новый депозит ERC20 токеном. Это верно даже при покупке в другом магазине, использующем этот же платёжный шлюз. Такое ограничение связано с особенностями стандарта ERC20 токена.

source: Step 1: Deposit funds to the payment gateway smart contract.
ru_ru: Шаг 1. Внесение средств на счёт смарт контракта платёжного шлюза.

source: This step calls the approve method on the token smart contract to allow the payment gateway contract to spend this amount of tokens on behalf of you. The Amount field is the amount of tokens you are required to pay for this order. The Value field is always 0 (zero) for token payments.
ru_ru: На этом этапе вызывается метод approve смарт контракта токена чтобы позволить контракту платёжного шлюза потратить эти токены от вашего имени. В поле Количество указано количество токенов к оплате за ваш заказ. В поле Value при оплате токенами всегда указывается 0 (нуль).

source: Payment succeeded!
ru_ru: Платёж подтверждён!

source: Payment succeeded! Reload page if it was not auto reloaded.
ru_ru: Платёж подтверждён! Обновите страницу.

source: Payment status: not complete.
ru_ru: Статус платежа: не завершён.

source: Payment status: deposit made.
ru_ru: Статус платежа: внесён депозит.

source: This wizard requires the MetaMask browser extension to be installed and your MetaMask account to be unlocked. If you do not want to use MetaMask, just copy and paste Value, Address, and Data fields in your favorite wallet software. Ensure these values are quoted exactly, otherwise we won't be able to reconcile your payment.
ru_ru: Эта форма оплаты нуждается в установке браузерного плагина MetaMask. Если вы уже установили этот плагин, создайте, импортируйте, или разблокируйте свой MetaMask аккаунт. Если вы не хотите использовать MetaMask, просто скопируйте поля "К оплате", "Адрес" и "Данные" в используемый вами Ethereum кошелёк и проведите транзакцию самостоятельно. Убедитесь, что значения скопированы верно, иначе ваши средства будут потеряны и мы не сможем вам их вернуть.

source: MetaMask network mismatch. Choose another network or ask site administrator.
ru_ru: Вы используете в MetaMask сеть Ethereum отличную от установленной на этом сайте. Попробуйте выбрать другую сеть, например, mainnet, или обратитесь к администрации сайта.

source: Choose Ether or ERC20 token
ru_ru: Валюта платежа

source: Amount
ru_ru: Сумма заказа

source: Advanced
ru_ru: Расширенные

source: Value
ru_ru: К оплате

source: QR
ru_ru: QR-код

source: Copy
ru_ru: Копировать

source: Address
ru_ru: Адрес

source: Data
ru_ru: Данные

source: Pay with MetaMask
ru_ru: Оплатить с помощью MetaMask

source: Download MetaMask!
ru_ru: Скачать MetaMask!

source: More...
ru_ru: Подробнее...

source: 1. Deposit funds
ru_ru: 1. Внести депозит

source: 2. Make payment
ru_ru: 2. Оплатить

source: Balance
ru_ru: Баланс на аккаунте

source: Previous
ru_ru: Назад

source: Next
ru_ru: Вперёд

source: Deposit with MetaMask
ru_ru: Внесение депозита с помощью MetaMask

source: Download MetaMask
ru_ru: Скачайте и установите MetaMask

source: Download MetaMask or input your ethereum address
ru_ru: Скачайте MetaMask или ведите свой Ethereum адрес

source: Unlock your MetaMask account please.
ru_ru: Выполните ход в свой аккаунт MetaMask.

source: Failed to pay ETH with MetaMask
ru_ru: Не удалось выполнить оплату ETH с помощью MetaMask

source: Pay ETH with MetaMask succeeded
ru_ru: Оплата ETH с помощью MetaMask выполнена успешно

source: Failed to deposit ETH with MetaMask
ru_ru: Не удалось внести депозит ETH с помощью MetaMask

source: Deposit ETH with MetaMask succeeded
ru_ru: Внесение депозита ETH с помощью MetaMask выполнена успешно

source: Failed to pay ERC20 token with MetaMask
ru_ru: Не удалось выполнить оплату токеном ERC20 с помощью MetaMask

source: Failed to pay ERC20 token: insufficient balance
ru_ru: Не удалось выполнить оплату токеном ERC20: недостаточный баланс

source: Pay ERC20 token with MetaMask succeeded
ru_ru: Оплата токеном ERC20 с помощью MetaMask выполнена успешно

source: Failed to pay ETH with MetaMask - rejected
ru_ru: Оплата ETH с помощью MetaMask отменена

source: Failed to pay ERC20 token with MetaMask - rejected
ru_ru: Оплата ERC20 токеном с помощью MetaMask отменена

source: Failed to deposit ERC20 token with MetaMask
ru_ru: Не удалось внести депозит токеном ERC20

source: Failed to deposit ERC20 token: insufficient balance
ru_ru: Не удалось внести депозит токеном ERC20: недостаточный баланс

source: Deposit ERC20 token with MetaMask succeeded
ru_ru: Депозит токеном ERC20 внесён успешно

source: Failed to deposit ETH with MetaMask - rejected
ru_ru: Внесение депозита ETH с помощью MetaMask отменена

source: Failed to deposit ERC20 token with MetaMask - rejected
ru_ru: Внесение депозита токеном ERC20 с помощью MetaMask отменена

source: Copied to clipboard
ru_ru: Скопировано в буфер обмена

source: ETH/ERC20 payment completed
ru_ru: Оплата с помощью ETH или ERC20 токена успешно заершена

source: Notification that payment by ETH/ERC20 has been received.
ru_ru: Оповещение об успешной оплате с помощью ETH или ERC20 токена.

source: Payment received
ru_ru: Оплата получена

source: Enable/Disable
ru_ru: Включить/Выключить

source: Enable this email notification
ru_ru: Включить оповещение на электронную почту

source: Subject
ru_ru: Тема письма

source: This controls the email subject line. Leave blank to use the default subject: <code>%s</code>.
ru_ru: Содержимое темы письма. Оставьте поле пустым для использования значения по умолчанию: <code>%s</code>.

source: Email Heading
ru_ru: Заголовок письма

source: This controls the main heading contained within the email notification. Leave blank to use the default heading: <code>%s</code>.
ru_ru: Содержимое заглавного содержимого письма. Оставьте поле пустым для использования значения по умолчанию: <code>%s</code>.

source: Email type
ru_ru: Формат письма

source: Choose which format of email to send.
ru_ru: Выберите какой формат письма использовать в оповещениях.

source: Plain text
ru_ru: Текст

source: Multipart
ru_ru: Составной

source: Payment received for order %d
ru_ru: Оплата получена для заказа № %d

source: Congratulations. We've received payment for your order. We've included your details below as a reminder of your order.
ru_ru: Поздравляем! Мы получили оплату по вашему заказу. Подробные детали по заказу включены далее.

source: Payment received for order %d.
ru_ru: Оплата получена для заказа № %d.
